Repository: AntonAveryan/ProjectWork_TeamF
Catalog: locale/*/LC_MESSAGES/django.po
Languages: lv, pl, ru

source: English
lv: Angļu
pl: Angielski
ru: Английский

source: German
lv: Vācu
pl: Niemiecki
ru: Немецкий

source: Russian
lv: Krievu
pl: Rosyjski
ru: Русский

source: Latvian
lv: Latviešu
pl: Łotewski
ru: Латышский

source: Polish
lv: Poļu
pl: Polski
ru: Польский

source: Kazakh
lv: Kazahu
pl: Kazachski
ru: Казахский

source: Home
lv: Sākums
pl: Strona główna
ru: Главная

source: How it works
lv: Kā tas strādā
pl: Jak to działa
ru: Как это работает

source: Pricing
lv: Cenas
pl: Cennik
ru: Тарифы

source: Sign in
lv: Pieteikties
pl: Zaloguj się
ru: Войти

source: Close sign in
lv: Aizvērt pieteikšanos
pl: Zamknij logowanie
ru: Закрыть окно входа

source: Come back to your AI-powered career space.
lv: Atgriezieties savā ar AI darbinātajā karjeras telpā.
pl: Wróć do swojej przestrzeni kariery opartej na AI.
ru: Вернитесь в своё карьерное пространство на базе ИИ.

source: Password
lv: Parole
pl: Hasło
ru: Пароль

source: Register
lv: Reģistrēties
pl: Zarejestruj się
ru: Зарегистрироваться

source: Back to start
lv: Atpakaļ uz sākumu
pl: Wróć na start
ru: Назад к началу

source: Dont be shy – ask questions
lv: Nekautrējies — uzdod jautājumus
pl: Nie wstydź się – zadawaj pytania
ru: Не стесняйтесь — задавайте вопросы

source: Our soft AI-powered career guidance will help you
lv: Mūsu maigais AI karjeras padomdevējs tev palīdzēs
pl: Nasze delikatne wsparcie kariery oparte na AI ci pomoże
ru: Наш мягкий карьерный помощник на базе ИИ вам поможет

source: Analyze my CV that I uploaded earlier, please.
lv: Lūdzu, analizē manu CV, ko es iepriekš augšupielādēju.
pl: Przeanalizuj proszę moje CV, które wcześniej przesłałem.
ru: Пожалуйста, проанализируй моё резюме, которое я загрузил ранее.

source: We have analysed your CV file and have options for you…
lv: Mēs esam analizējuši tavu CV un sagatavojuši iespējas…
pl: Przeanalizowaliśmy twoje CV i mamy dla ciebie kilka możliwości…
ru: Мы проанализировали ваше резюме и подготовили для вас варианты…

source: Your studies and experience show that you might be a perfect fit for IT-support positions. We have already found a couple nice positions that suit you perfectly, but if you would like to clarify more your experience or understand where you have skill issues, you're welcome to ask further questions.
lv: Tavas studijas un pieredze liecina, ka tu lieliski derētu IT atbalsta amatiem. Mēs jau atradām vairākus piemērotus darba piedāvājumus, bet, ja vēlies precizēt savu pieredzi vai saprast, kurās prasmēs ir izaicinājumi, droši jautā.
pl: Twoje studia i doświadczenie pokazują, że świetnie pasujesz do stanowisk w IT-supporcie. Znaleźliśmy już kilka ciekawych ofert idealnie dopasowanych do ciebie, ale jeśli chcesz doprecyzować swoje doświadczenie albo zrozumieć, gdzie masz luki w umiejętnościach, śmiało zadawaj kolejne pytania.
ru: Ваше обучение и опыт показывают, что вы отлично подходите для позиций в IT-поддержке. Мы уже нашли несколько хороших вакансий, которые вам подходят, но если вы хотите подробнее прояснить свой опыт или понять, где у вас есть пробелы в навыках, смело задавайте дополнительные вопросы.

source: To positions →
lv: Uz vakancēm →
pl: Do ofert →
ru: К вакансиям →

source: I want to try PM soon, what do I need to do?
lv: Es drīzumā vēlos izmēģināt PM lomu — kas man jādara?
pl: Chcę wkrótce spróbować roli PM — co muszę zrobić?
ru: Я хочу скоро попробовать себя в роли PM — что мне нужно сделать?

source: Here are the steps you need to take to be a great PM:
lv: Lūk, soļi, kas jāveic, lai kļūtu par lielisku PM:
pl: Oto kroki, które musisz podjąć, aby zostać świetnym PM-em:
ru: Вот шаги, которые помогут вам стать отличным PM:

source: Know the user.
lv: Pazīsti lietotāju.
pl: Poznaj użytkownika.
ru: Познайте пользователя.

source: Define clear problems.
lv: Definē skaidras problēmas.
pl: Definiuj jasno problemy.
ru: Формулируйте проблемы ясно.

source: Prioritize ruthlessly.
lv: Prioritizē nežēlīgi.
pl: Priorytetyzuj bez litości.
ru: Расставляйте приоритеты безжалостно.

source: Communicate simply.
lv: Komunicē vienkārši.
pl: Komunikuj się prosto.
ru: Общайтесь просто.

source: Ship fast, learn faster.
lv: Piegādā ātri, mācies vēl ātrāk.
pl: Dostarczaj szybko, ucz się jeszcze szybciej.
ru: Выпускайте быстро, учитесь ещё быстрее.

source: Align teams, remove blockers.
lv: Saskaņo komandas, noņem šķēršļus.
pl: Uzgadniaj pracę zespołów, usuwaj blokery.
ru: Синхронизируйте команды, убирайте блокеры.

source: Measure outcomes, not output.
lv: Mēri rezultātus, nevis apjomu.
pl: Mierz rezultaty, nie tylko ilość pracy.
ru: Измеряйте результаты, а не объём работы.

source: Iterate forever.
lv: Iterē nepārtraukti.
pl: Iteruj bez końca.
ru: Итерируйтесь бесконечно.

source: These are the core competencies you need to excel and find a strong position. If you have any further questions I can clarify the steps in detail.
lv: Tās ir galvenās kompetences, kas nepieciešamas, lai izceltos un iegūtu spēcīgu pozīciju. Ja ir papildu jautājumi, varu detalizēti izskaidrot katru soli.
pl: To są kluczowe kompetencje, których potrzebujesz, żeby się wyróżnić i zająć mocną pozycję. Jeśli masz dodatkowe pytania, mogę omówić każdy krok bardziej szczegółowo.
ru: Это ключевые компетенции, которые помогут вам выделиться и занять сильную позицию. Если у вас будут дополнительные вопросы, я могу подробно разобрать каждый шаг.

source: Hi, how can I help you? Upload your CV and I will analyze and help find positions.
lv: Sveiki, kā varu palīdzēt? Augšupielādējiet savu CV, un es to izanalizēšu un palīdzēšu atrast piemērotas vakances.
pl: Cześć, w czym mogę pomóc? Prześlij swoje CV, a ja je przeanalizuję i pomogę znaleźć odpowiednie stanowiska.
ru: Здравствуйте, чем могу помочь? Загрузите свое резюме, я его проанализирую и помогу найти вакансии.

source: Username
lv: Lietotājvārds
pl: Nazwa użytkownika
ru: Имя пользователя

source: username
lv: lietotājvārds
pl: nazwa użytkownika
ru: имя пользователя

source: JWT-based authentication with secure token storage.
lv: JWT balstīta autentifikācija ar drošu tokenu glabāšanu.
pl: Uwierzytelnianie oparte na JWT z bezpiecznym przechowywaniem tokenów.
ru: Аутентификация на основе JWT с безопасным хранением токенов.

source: Upload PDF CV
lv: Augšupielādēt PDF CV
pl: Prześlij CV w formacie PDF
ru: Загрузить PDF резюме

source: Upload your CV or ask any questions
lv: Augšupielādē savu CV vai uzdod jebkuru jautājumu
pl: Prześlij swoje CV albo zadaj dowolne pytanie
ru: Загрузите своё резюме или задайте любой вопрос

source: Find clarity in a world full of choices. Let AI guide your next career step with confidence.
lv: Atrodi skaidrību pasaulē, kur pilns ar izvēlēm. Ļauj AI droši vadīt tavu nākamo karjeras soli.
pl: Znajdź jasność w świecie pełnym wyborów. Pozwól AI poprowadzić twój kolejny krok w karierze z pewnością.
ru: Найдите ясность в мире бесконечных выборов. Позвольте ИИ уверенно направить ваш следующий шаг в карьере.

source: Who is CareerVision for?
lv: Kam ir domāts CareerVision?
pl: Dla kogo jest CareerVision?
ru: Для кого создан CareerVision?

source: Career paths today are rarely linear. We built CareerVision for people who feel a bit lost, overwhelmed by options, or simply curious what else they could do with their skills.
lv: Mūsdienās karjeras ceļi reti ir lineāri. Mēs izveidojām CareerVision cilvēkiem, kuri jūtas apjukuši, pārņemti ar iespējām vai vienkārši ziņkārīgi par to, ko vēl varētu darīt ar savām prasmēm.
pl: Ścieżki kariery rzadko są dziś liniowe. Stworzyliśmy CareerVision dla osób, które czują się trochę zagubione, przytłoczone możliwościami albo po prostu ciekawe, co jeszcze mogłyby robić ze swoimi umiejętnościami.
ru: Сегодня карьерные пути редко бывают линейными. Мы создали CareerVision для тех, кто чувствует себя немного потерянным, кого перегружают варианты или кто просто интересуется, как ещё можно использовать свои навыки.

source: Students
lv: Studenti
pl: Studenci
ru: Студенты

source: Just starting out? We help you choose a direction that matches your potential, not just your degree.
lv: Tu tikai sāksi savu ceļu, mēs palīdzēsim izvēlēties virzienu, kas atbilst tavam potenciālam, ne tikai diplomam.
pl: Dopiero zaczynasz, pomożemy ci wybrać kierunek, który pasuje do twojego potencjału, a nie tylko do dyplomu.
ru: Вы только начинаете, мы поможем выбрать направление, которое соответствует вашему потенциалу, а не только диплому.

source: Graduates
lv: Absolventi
pl: Absolwenci
ru: Выпускники

source: Show the world what you’re capable of. Our AI highlights your strengths and turns them into career opportunities.
lv: Parādi pasaulei, uz ko esi spējīgs. Mūsu AI izceļ tavas stiprās puses un pārvērš tās karjeras iespējās.
pl: Pokaż światu, na co cię stać. Nasze AI podkreśla twoje mocne strony i zamienia je w szanse kariery.
ru: Покажите миру, на что вы способны. Наш ИИ подсвечивает ваши сильные стороны и превращает их в карьерные возможности.

source: Career switchers
lv: Karjeras maiņas meklētāji
pl: Osoby zmieniające karierę
ru: Меняющие карьеру

source: Changing paths is hard. We make it easier by translating your past experience into future roles.
lv: Mainīt karjeras virzienu ir grūti. Mēs to padarām vieglāku, pārnesot tavu pieredzi uz nākotnes lomām.
pl: Zmiana ścieżki jest trudna. Ułatwiamy ją, przekładając twoje dotychczasowe doświadczenie na przyszłe role.
ru: Менять путь сложно. Мы упрощаем это, переводя ваш прошлый опыт в понятные будущие роли.

source: Internships & junior roles
lv: Prakses un junioru amati
pl: Staże i role juniorów
ru: Стажировки и junior-позиции

source: No experience? No problem. We focus on skills, motivation, and hidden strengths, not job titles.
lv: Nav pieredzes? Nekādu problēmu. Mēs fokusējamies uz prasmēm, motivāciju un slēptajām stiprajām pusēm, nevis amatu nosaukumiem.
pl: Brak doświadczenia? Żaden problem. Skupiamy się na umiejętnościach, motywacji i ukrytych mocnych stronach, nie na nazwach stanowisk.
ru: Нет опыта? Не беда. Мы смотрим на навыки, мотивацию и скрытые сильные стороны, а не на названия должностей.

source: What happens behind the scenes?
lv: Kas notiek aizkulisēs?
pl: Co dzieje się za kulisami?
ru: Что происходит за кулисами?

source: Upload your CV
lv: Augšupielādē savu CV
pl: Prześlij swoje CV
ru: Загрузите своё резюме

source: Your background is more powerful than you think. We read your experience, skills, and patterns.
lv: Tavs pieredzes kopums ir spēcīgāks, nekā domā. Mēs analizējam tavas prasmes, pieredzi un modeļus.
pl: Twoja historia jest silniejsza, niż myślisz. Analizujemy twoje doświadczenie, umiejętności i schematy działania.
ru: Ваш опыт намного сильнее, чем вы думаете. Мы анализируем ваш путь, навыки и привычные подходы.

source: AI analysis
lv: AI analīze
pl: Analiza AI
ru: Анализ ИИ

source: Our model finds strengths, transferable skills, and suitable roles, instantly.
lv: Mūsu modelis uzreiz atrod tavas stiprās puses, pārnesamās prasmes un piemērotās lomas.
pl: Nasz model natychmiast znajduje twoje mocne strony, umiejętności transferowalne oraz odpowiednie role.

source: Chat with your AI advisor
lv: Tērzē ar savu AI padomdevēju
pl: Porozmawiaj ze swoim doradcą AI
ru: Пообщайтесь с вашим AI-консультантом

source: Ask anything: skills, weaknesses, what to improve, what roles fit you best.
lv: Jautā jebko: prasmes, vājās puses, ko uzlabot un kādi amati tev vislabāk der.
pl: Pytaj o wszystko: umiejętności, słabe strony, co poprawić i jakie role pasują do ciebie najlepiej.
ru: Спрашивайте о чём угодно: навыках, слабых местах, том, что стоит улучшить, и о ролях, которые подходят вам лучше всего.

source: Tailored job suggestions
lv: Pielāgāti darba piedāvājumi
pl: Dopasowane oferty pracy
ru: Персональные предложения вакансий

source: Based on your profile, we show real positions that match your goals and skill set.
lv: Balstoties uz tavu profilu, mēs parādām reālus darba piedāvājumus, kas atbilst taviem mērķiem un prasmēm.
pl: Na podstawie twojego profilu pokazujemy realne oferty odpowiadające twoim celom i zestawowi umiejętności.
ru: На основании вашего профиля мы показываем реальные вакансии, которые соответствуют вашим целям и навыкам.

source: Everyone deserves a career that feels right. Let’s help you find yours.
lv: Ikviens ir pelnījis karjeru, kas šķiet pareiza. Palīdzēsim atrast tavu.
pl: Każdy zasługuje na karierę, która jest „jego”. Pozwól, że pomożemy ci odnaleźć twoją.
ru: Каждый заслуживает карьеру, которая ощущается своей. Давайте поможем вам найти вашу.

source: Start now →
lv: Sākt tagad →
pl: Zacznij teraz →
ru: Начать сейчас →

source: Discover Your Potential
lv: Atklāj savu potenciālu
pl: Odkryj swój potencjał
ru: Откройте свой потенциал

source: Soft AI-powered career guidance in an everchanging world.
lv: Maigs, ar AI darbināts karjeras atbalsts nemitīgi mainīgā pasaulē.
pl: Delikatne, oparte na AI wsparcie kariery w ciągle zmieniającym się świecie.
ru: Ненавязчивая карьерная поддержка на базе ИИ в постоянно меняющемся мире.

source: What you need to do:
lv: Kas tev jādara:
pl: Co musisz zrobić:
ru: Что нужно сделать:

source: Let the AI analyze your background and suggest the best career paths.
lv: Ļauj AI analizēt tavu pieredzi un piedāvāt labākos karjeras virzienus.
pl: Pozwól AI przeanalizować twoją historię i zaproponować najlepsze ścieżki kariery.
ru: Позвольте ИИ проанализировать ваш путь и предложить лучшие варианты карьеры.

source: Upload your resume or write about yourself.
lv: Augšupielādē savu CV vai uzraksti par sevi.
pl: Prześlij swoje CV albo napisz coś o sobie.
ru: Загрузите резюме или напишите о себе.

source: AI analyzes your skills and strengths.
lv: AI analizē tavas prasmes un stiprās puses.
pl: AI analizuje twoje umiejętności i mocne strony.
ru: ИИ анализирует ваши навыки и сильные стороны.

source: You get personal career suggestions.
lv: Tu saņem personīgus karjeras ieteikumus.
pl: Otrzymujesz spersonalizowane propozycje kariery.
ru: Вы получаете персональные карьерные рекомендации.

source: No spam. No adds. Just clarity.
lv: Bez spama. Bez reklāmām. Tikai skaidrība.
pl: Bez spamu. Bez reklam. Sama klarowność.
ru: Никакого спама. Никакой рекламы. Только ясность.

source: Back to chat
lv: Atpakaļ uz tērzēšanu
pl: Wróć do czatu
ru: Назад к чату

source: Position perfectly suits you
lv: Pozīcija lieliski tev der
pl: To stanowisko idealnie do ciebie pasuje
ru: Эта позиция идеально вам подходит

source: Find positions easier
lv: Atrast vakances vienkāršāk
pl: Łatwiej znajdź oferty pracy
ru: Проще находить подходящие вакансии

source: LinkedIn Job Listing
lv: LinkedIn darba piedāvājumi
pl: Oferty pracy z LinkedIn
ru: Вакансии с LinkedIn

source: Sort
lv: Kārtot
pl: Sortuj
ru: Сортировать

source: Refresh
lv: Atjaunot
pl: Odśwież
ru: Обновить

source: Favorites
lv: Favorīti
pl: Ulubione
ru: Избранное

source: more…
lv: vairāk…
pl: więcej…
ru: ещё…

source: Apply →
lv: Pieteikties →
pl: Aplikuj →
ru: Откликнуться →

source: No jobs found yet. Try to refresh or update your CV.
lv: Vēl nav atrasti darba piedāvājumi. Mēģini atjaunot vai papildināt savu CV.
pl: Nie znaleziono jeszcze żadnych ofert. Spróbuj odświeżyć stronę albo zaktualizować swoje CV.
ru: Подходящих вакансий пока не найдено. Попробуйте обновить страницу или обновить своё резюме.

source: Date posted
lv: Publicēšanas datums
pl: Data dodania
ru: Дата публикации

source: Newest first
lv: Jaunākie vispirms
pl: Najpierw najnowsze
ru: Сначала новые

source: Oldest first
lv: Vecākie vispirms
pl: Najpierw najstarsze
ru: Сначала старые

source: Experience level
lv: Pieredzes līmenis
pl: Poziom doświadczenia
ru: Уровень опыта

source: Any
lv: Jebkurš
pl: Dowolny
ru: Любой

source: Junior
lv: Junioru

source: Mid
lv: Vidējais
ru: Middle

source: Senior
lv: Senioru

source: Company
lv: Uzņēmums
pl: Firma
ru: Компания

source: Remote
lv: Attālināti
pl: Zdalnie
ru: Удалённо

source: On-site
lv: Uz vietas
pl: Stacjonarnie
ru: В офисе

source: Hybrid
lv: Hibrīds
pl: Hybrydowo
ru: Гибридный формат

source: Clear all
lv: Notīrīt visu
pl: Wyczyść wszystko
ru: Сбросить всё

source: Apply filter
lv: Piemērot filtrus
pl: Zastosuj filtr
ru: Применить фильтр

source: Your favorite jobs
lv: Tavi mīļākie darbi
pl: Twoje ulubione zadania
ru: Ваши любимые работы

source: Jobs you saved while browsing recommendations.
lv: Darbi, kurus saglabājāt, pārlūkojot ieteikumus.
pl: Oferty pracy zapisane podczas przeglądania rekomendacji.
ru: Вакансии, которые вы сохранили во время просмотра рекомендаций.

source: Back to positions
lv: Atgriezties pie pozīcijām
pl: Powrót do pozycji
ru: Вернуться к позициям

source: Right now, CareerVision is in a testing & learning phase.
lv: Pašlaik CareerVision ir testēšanas un uzlabošanas fāzē.
pl: Obecnie CareerVision jest w fazie testów i zbierania doświadczeń.
ru: Сейчас CareerVision находится в стадии тестирования и обучения.

source: Beta mode. No paywall. No subscription.
lv: Beta režīms. Bez maksas sienas. Bez abonementa.
pl: Tryb beta. Bez paywalla. Bez subskrypcji.
ru: Бета-режим. Без платного доступа. Без подписки.

source: We're building CareerVision as a project to explore how AI can support real people making real career decisions — especially students, graduates, and early-career professionals.
lv: Mēs veidojam CareerVision kā projektu, lai izpētītu, kā AI var atbalstīt reālus cilvēkus, pieņemot reālus karjeras lēmumus — īpaši studentus, absolventus un karjeras sākuma profesionāļus.
pl: Tworzymy CareerVision jako projekt badający, jak AI może wspierać prawdziwych ludzi w podejmowaniu prawdziwych decyzji zawodowych — szczególnie studentów, absolwentów i osoby na początku kariery.
ru: Мы развиваем CareerVision как проект, который исследует, как ИИ может поддерживать реальных людей в принятии реальных карьерных решений — особенно студентов, выпускников и специалистов в начале пути.

source: Current status: Free to use
lv: Pašreizējais statuss: Bez maksas
pl: Aktualny status: bezpłatne korzystanie
ru: Текущий статус: можно пользоваться бесплатно

source: No credit card required.
lv: Nav nepieciešama kredītkarte.
pl: Karta kredytowa nie jest wymagana.
ru: Банковская карта не требуется.

source: No hidden plans or upsells.
lv: Nav slēptu plānu vai papildpārdošanas.
pl: Brak ukrytych planów i dosprzedaży.
ru: Никаких скрытых тарифов и допродаж.

source: Use it, break it, tell us what feels confusing.
lv: Lieto, lauz, un pastāsti mums, ja kaut kas šķiet neskaidrs.
pl: Korzystaj, psuj i daj nam znać, co jest niejasne.
ru: Пользуйтесь, ломайте и рассказывайте нам, что кажется непонятным.

source: If you have feedback, feature ideas or just want to say hi, drop a line to:
lv: Ja tev ir atsauksmes, idejas vai vienkārši vēlies pateikt sveiki, raksti uz:
pl: Jeśli masz uwagi, pomysły na funkcje albo po prostu chcesz się przywitać, napisz na:
ru: Если у вас есть обратная связь, идеи по функциям или просто хотите сказать «привет», напишите на:

source: In the future, we might explore premium features. For now, just enjoy using it and focus on your next step.
lv: Nākotnē mēs varētu apsvērt premium funkcijas, bet pagaidām vienkārši izbaudi lietošanu un koncentrējies uz nākamo soli.
pl: W przyszłości być może wprowadzimy funkcje premium, ale na razie po prostu korzystaj z narzędzia i skup się na swoim kolejnym kroku.
ru: В будущем мы можем добавить платные функции, но сейчас просто пользуйтесь сервисом и концентрируйтесь на своём следующем шаге.

source: Logout
lv: Iziet
pl: Wyloguj
ru: Выйти

source: Search jobs in city
lv: Meklēt darbu pilsētā
pl: Wyszukaj oferty pracy w mieście
ru: Поиск вакансий в городе

source: Chat
lv: Tērzēšana
pl: Czat
ru: Чат

source: Our model finds strengths, transferable skills, and suitable roles, instantly.
ru: Наша модель мгновенно находит ваши сильные стороны, переносимые навыки и подходящие роли.
